Revit 2026 API

# FailuresAccessorIsElementsDeletionPermitted(IListElementId) Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsElementsDeletionPermitted(
	IList<ElementId> idsToDelete
)
```
```vb
Public Function IsElementsDeletionPermitted (
	idsToDelete As IList(Of ElementId)
) As Boolean
```
```cpp
public:
bool IsElementsDeletionPermitted(
	IList<ElementId^>^ idsToDelete
)
```
```fsharp
member IsElementsDeletionPermitted :
        idsToDelete : IList<ElementId> -> bool
```

#### Parameters

idsToDelete IListElementId

#### Return Value

Boolean

#### Reference

FailuresAccessor Class

IsElementsDeletionPermitted Overload

Autodesk.Revit.DB Namespace